Aarhus
Denmark
AAR
Abadan
Iran
ABD
Abeche
Chad
AEH
Aberdeen
United
Kingdom
ABZ
Aberdeen
USA
ABR
Abidjan
Cote
d'Ivoire
ABJ
Abilene
USA
ABI
Abu
Dhabi
Abu
Dhabi
International
United
Arab
Emirates
AUH
Abuja
Nnamdi
Azikiwe
International
Airport
Nigeria
ABV
Abu
Rudeis
Egypt
AUE
Abu
Simbel
Egypt
ABS
Acapulco
Mexico
ACA
Accra
Kotoka
International
Airport
Ghana
ACC
Adana
Turkey
ADA
Addis
Ababa
Bole
International
Airport
Ethiopia
ADD
Adelaide
Australia
ADL
Aden
Aden
International
Airport
Yemen
ADE
Adiyaman
Turkey
ADF
Adler/Sochi
Russia
AER
Agades
Niger
AJY
Agadir
Morocco
AGA
Agana
Guam
SUM
Aggeneys
South
Africa
AGZ
Aguadilla
Puerto
Rico
BQN
Aguascaliente
Mexico
AGU
Ahmedabad
India
AMD
Aiyura
Papua
New
Guinea
AYU
Ajaccio
France
AJA
Akita
Japan
AXT
Akron
USA
CAK
Akrotiri
RAF
Cyprus
AKT
Al
Ain
United
Arab
Emirates
AAN
Al
Arish
Egypt
AAC
Albany
Australia
ALH
Albany
USA
ABY
Albany
Albany
International
Airport
USA
ALB
Albi
France
LBI
Alborg
Denmark
AAL
Albuquerque
USA
ABQ
Albury
Australia
ABX
Alderney
Channel
Islands
ACI
Aleppo
Syria
ALP
Alesund
Norway
AES
Alexander
Bay
Kortdoorn
South
Africa
ALJ
Alexandria
Borg
el
Arab
Airport
Egypt
HBH
Alexandria
El
Nhouza
Airport
Egypt
ALY
Alexandria
Esler
Field
USA
ESF
Alfujairah
United
Arab
Emirates
FJR
Alghero
Sassari
Italy
AHO
Algiers,
Houari
Boumediene
Airport
Algeria
ALG
Al
Hoceima
Morocco
AHU
Alicante
Spain
ALC
Alice
Springs
Australia
ASP
Alldays
South
Africa
ADY
Allentown
USA
ABE
Almaty
Almaty
International
Airport
Kazakhstan
ALA
Almeria
Spain
LEI
Alta
Norway
ALF
Altay
PR
China
AAT
Altenrhein
Switzerland
ACH
Altoona
USA
AOO
Altus
USA
AXS
Amami
Japan
ASJ
Amarillo
USA
AMA
Amazon
Bay
Papua
New
Guinea
AZB
Amman
Queen
Alia
International
Airport
Jordan
AMM
Amman
AmmanMarka
International
Airport
Jordan
ADJ
Amritsar
India
ATQ
Amsterdam
Amsterdam
Airport
Schiphol
Netherlands
AMS
Anand
India
QNB
Anchorage
Ted
Stevens
Anchorage
International
USA
ANC
Ancona
Ancona
Falconara
Airport
Italy
AOI
Andorra
La
Vella
Heliport
Andorra
ALV
Anguilla
Anguilla
AXA
Anjouan
Anjouan
Airport
Comoros
AJN
Ankara
Turkey
ANK
Ankara
Esenboğa
International
Airport
Turkey
ESB
Annaba
Algeria
AAE
Ann
Arbor
USA
ARB
Annecy
France
NCY
Anniston
USA
ANB
Antalya
Turkey
AYT
Antananarivo
Ivato
International
Airport
Madagascar
TNR
Antigua,
V.C.
Bird
International
Antigua
and
Barbuda
ANU
Antwerp
Belgium
ANR
Aomori
Japan
AOJ
Apia
Faleolo
International
Airport
Samoa
APW
Appelton/Neenah/Menasha
USA
ATW
Aqaba
Jordan
AQJ
Aracaju
Brazil
AJU
Arkhangelsk
Russia
ARH
Arusha
Tanzania
ARK
Araxos
Greece
GPA
Arlit
Niger
RLT
Arrecife/Lanzarote
Spain
ACE
Aruba
Reina
Beatrix
International,
Oranjestad
Aruba
AUA
Asheville
USA
AVL
Ashgabat
Saparmurat
Turkmenbashy
Int.
Airport
Turkmenistan
ASB
Asmara
Asmara
International
Eritrea
ASM
Aspen,
AspenPitkin
County
Airport
USA
ASE
Assiut
Egypt
ATZ
Astana
Astana
International
Airport
Kazakhstan
TSE
Asuncion
Asunción
International
Airport
Paraguay
ASU
Aswan
Daraw
Airport
Egypt
ASW
Athens
Elefthérios
Venizélos
International
Airport
Greece
ATH
Athens,
Hellinikon
Airport
Greece
HEW
Athens
USA
AHN
Athens
USA
ATO
Atlanta
Hartsfield
Atlanta
International
Airport
USA
ATL
Atlantic
City
Atlantic
City
International
USA
ACY
Attawapiskat,
NT
Canada
YAT
Auckland
Auckland
International
Airport
New
Zealand
AKL
Augsburg
Augsbur
gAirport
Germany
AGB
Augusta
USA
AGS
Augusta
Augusta
State
Airport
USA
AUG
Aurillac
France
AUR
Austin
AustinBergstrom
Airport
USA
AUS
Ayawasi
Indonesia
AYW
Ayers
Rock
Connellan
Australia
AYQ
Ayr
Australia
AYR
B
Badajoz
Spain
BJZ
Bagdad
Baghdad
International
Airport
Iraq
BGW
Bagdogra
India
IXB
Bahamas
Lynden
Pindling
International
Airport
The
Bahamas
NAS
Bahawalpur
Pakistan
BHV
Bahrain
Bahrain
International
Airport
Bahrain
BAH
Bakersfield
USA
BFL
Baku
Heydar
Aliyev
International
Airport
Azerbaijan
BAK
Ballina
Australia
BNK
Baltimore
Washington
International
Airport
USA
BWI
Bamaga
Australia
ABM
Bamako
BamakoSénou
International
Airport
Mali
BKO
Bambari
Central
African
Republic
BBY
Bandar
Seri
Begawan
Brunei
International
Airport
Brunei
BWN
Bandung
Husein
Sastranegara
International
Airport
Indonesia
BDO
Bangalore
India
BLR
Bangassou
Central
African
Republic
BGU
Bangkok,
Don
Muang
Thailand
DMK
Bangkok,
Suvarnabhumi
International
Thailand
BKK
Bangor
USA
BGR
Bangui
M'Poko
International
Airport
Central
African
Republic
BGF
Banjul
Banjul
International
Airport
Gambia
BJL
Bannu
Pakistan
BNP
Barcelona
Spain
BCN
Barcelona
Venezuela
BLA
Bardufoss
Norway
BDU
Bari
Italy
BRI
Barisal
Bangladesh
BZL
Baroda
India
BDQ
Barra
United
Kingdom
BRR
Barranquilla
Colombia
BAQ
Basel
Switzerland
BSL
Basel/Mulhouse
Switzerland/France
EAP
Basra,
Basrah
Iraq
BSR
BasseTerre
PointeàPitre
International
Airport
Guadeloupe
PTP
Basseterre
Robert
L.
Bradshaw
International
Airport
Saint
Kitts
and
Nevis
SKB
Bastia
France
BIA
Baton
Rouge
Baton
Rouge
Metropolitan
Airport
USA
BTR
Bayreuth
BindlacherBerg
Germany
BYU
Beaumont/Pt.
Arthur
USA
BPT
Beckley
USA
BKW
Beef
Island
Terrance
B.
Lettsome
Virgin
Islands
EIS
Beijing
China
PEK
Beijing
Nanyuan
Airport
China
NAY
Beira
Mozambique
BEW
Beirut
Beirut
Rafic
Hariri
International
Airport
Lebanon
BEY
Belem
Val
de
Cans
International
Airport
Brazil
BEL
Belfast
George
Best
Belfast
City
Airport
United
Kingdom
BHD
Belfast
Belfast
International
Airport
United
Kingdom
BFS
Belgaum
India
IXG
Belgrad
Belgrade
Nikola
Tesla
International
Serbia
BEG
Belize
City
Philip
S.W.Goldson
International
Belize
BZE
Bellingham
USA
BLI
Belo
Horizonte
Tancredo
Neves
International
Airport
Brazil
CNF
Bemidji
USA
BJI
Benbecula
United
Kingdom
BEB
Benghazi
Libya
BEN
Benguela
Angola
BUG
Benton
Harbour
USA
BEH
Berberati
Central
African
Republic
BBT
Bergamo/Milan
Orio
Al
Serio
Italy
BGY
Bergen
Norway
BGO
Bergerac
Roumanieres
France
EGC
Berlin
Germany
BER
Berlin,
Schoenefeld
Germany
SXF
Berlin,
Tegel
Germany
TXL
Berlin,
Tempelhof
Germany
THF
Bermuda
L.F.
Wade
International
Airport
Bermuda
BDA
Berne,
BernBelp
Switzerland
BRN
Berne,
Railway
Service
Switzerland
ZDJ
Bethel
USA
BET
Bhopal
India
BHO
Bhubaneswar
India
BBI
Biarritz
France
BIQ
Bilbao
Spain
BIO
Billings
USA
BIL
Billund
Denmark
BLL
Bintulu
Malaysia
BTU
Biraro
Central
African
Republic
IRO
Birmingham
Birmingham
International
Airport
United
Kingdom
BHX
Birmingham
USA
BHM
Bishkek
Manas
International
Airport
Kyrgyzstan
FRU
Bismarck
Bismarck
Municipal
Airport
USA
BIS
Bissau
Osvaldo
Vieiro
International
Airport
GuineaBissau
BXO
Blackpool
United
Kingdom
BLK
Blackwater
Australia
BLT
Blantyre
Chileka
International
Airport
Malawi
BLZ
Blenheim
New
Zealand
BHE
Bloemfontein
Bloemfontein
Airport
South
Africa
BFN
Bloomington
USA
BMI
Bloomington
USA
BMG
Bluefield
USA
BLF
Boa
Vista
Brazil
BVB
Bobo/Dioulasso
Burkina
Faso
BOY
Bodo
Norway
BOO
Bodrum
Milas
Airport
Turkey
BJV
Bogota
El
Nuevo
Dorado
International
Airport
Colombia
BOG
Boise
Boise
Air
Terminal
USA
BOI
Bologna
Italy
BLQ
Bombay
Chhatrapati
Shivaji
International
India
BOM
Bonaire
Netherlands
Antilles
BON
Bonaventure,
PQ
Canada
YVB
Bora
Bora
French
Polynesia
BOB
Bordeaux
Bordeaux
Airport
France
BOD
Borrego
Springs
USA
BXS
Boston
General
Edward
Lawrence
Logan
USA
BOS
Bouake
Cote
d'Ivoire
BYK
Bourgas/Burgas
Bulgaria
BOJ
Bournemouth
United
Kingdom
BOH
Bowen
Australia
ZBO
Bozeman
USA
BZN
Bradford/Warren
/Olean
USA
BFD
Brainerd
USA
BRD
Brampton
Island
Australia
BMP
Brasilia
President
Juscelino
Kubitschek
International
Brazil
BSB
Bratislava
M.
R.
Štefánik
Airport
Slovakia
BTS
Brazzaville
MayaMaya
Airport
Congo
BZV
Bremen
Bremen
Airport
Germany
BRE
Brescia,
Montichiari
Italy
VBS
Brest
France
BES
Bria
Central
African
Republic
BIV
Bridgeport
USA
BDR
Bridgetown
Grantley
Adams
International
Barbados
BGI
Brindisi
Italy
BDS
Brisbane
Australia
BNE
Bristol
United
Kingdom
BRS
Broennoeysund
Norway
BNN
Broken
Hill
Australia
BHQ
Brookings
USA
BKX
Broome
Australia
BME
Brunswick
USA
BQK
Brussels
Brussels
Airport
Belgium
BRU
Bucaramanga
Colombia
BGA
Bucharest
Romania
BUH
Bucharest
Henri
Coandă
International
Airport
Romania
OTP
Budapest
Budapest
Ferihegy
International
Airport
Hungary
BUD
Buenos
Aires
Argentina
BUE
Buenos
Aires,
Ezeiza
International
Airport
Argentina
EZE
Buenos
Aires,
Jorge
Newbery
Argentina
AEP
Buffalo
Range
Zimbabwe
BFO
Buffalo/Niagara
Falls
USA
BUF
Bujumbura
Bujumbura
International
Airport
Burundi
BJM
Bulawayo
Zimbabwe
BUQ
Bullhead
City
USA
BHC
Bundaberg
Australia
BDB
Burbank
USA
BUR
Burlington
IA
USA
BRL
Burlington
USA
BTV
Burnie
Australia
BWT
Butte
USA
BTM
